
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ДвоичныеДанные = РеквизитФормыВЗначение("Объект").ПолучитьМакет("КлючиАналитикиКартинка");
	
	Картинка = Новый Картинка(ДвоичныеДанные);
	АдресКартинки = ПоместитьВоВременноеХранилище(Картинка, УникальныйИдентификатор);
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ПодключитьОбработчикОжидания("ЗакрытьОкноНеВФокусе", 1, Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗакрытьОкноНеВФокусе() Экспорт 
	
	Если Открыта() И ЗакрыватьЕслиНеВФокусе = Ложь Тогда
		ЗакрыватьЕслиНеВФокусе = Истина;
	КонецЕсли;
	
	Если ВводДоступен() = Ложь И ЗакрыватьЕслиНеВФокусе Тогда
		Окна = ПолучитьОкна();
		
		Закрыть();
	КонецЕсли;
	
	ПодключитьОбработчикОжидания("ЗакрытьОкноНеВФокусе", 0.3, Истина);
	
КонецПроцедуры