&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Параметры.Свойство("УзелПланаОбмена", УзелПланаОбмена);
	Параметры.Свойство("НомерСообщения", НомерСообщения);
	
	УстановитьЗаголовок();
	
	УстановитьУсловноеОформление();
	
КонецПроцедуры

&НаКлиенте
Процедура Добавить(Команда)
	
	Результат = Новый Структура();
	Результат.Вставить("УзелПланаОбмена", УзелПланаОбмена);
	Результат.Вставить("НомерСообщения", НомерСообщения);
	
	Закрыть(Результат);
	
КонецПроцедуры

&НаКлиенте
Процедура УзелПланаОбменаПриИзменении(Элемент)
	
	ЗаполнитьНомерОтправленногоПринятого();
	
	УстановитьЗаголовок();
	УстановитьУсловноеОформление();
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьНомерОтправленногоПринятого() 
	
	Если ЗначениеЗаполнено(УзелПланаОбмена) Тогда
		НомерПринятого = УзелПланаОбмена.НомерПринятого;
		НомерОтправленного = УзелПланаОбмена.НомерОтправленного;
	Иначе
		НомерПринятого = 0;
		НомерОтправленного = 0;
	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура УстановитьЗаголовок() 
	
	Если ЗначениеЗаполнено(УзелПланаОбмена) Тогда
		ПланОбмена = Строка(УзелПланаОбмена.Метаданные());
		Заголовок = "План обмена: " + ПланОбмена;
	Иначе
		Заголовок = "Выберите план обмена";
	КонецЕсли;
	
КонецПроцедуры


&НаСервере
Процедура УстановитьУсловноеОформление()
	
	
	Элементы.НомерСообщения.Доступность = ЗначениеЗаполнено(УзелПланаОбмена)
	И (УзелПланаОбмена.НомерПринятого <> 0
	Или УзелПланаОбмена.НомерОтправленного <> 0);
	
КонецПроцедуры



