&НаКлиенте
Перем мСоотвМетаданных;

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ПолучитьПараметры();
	
	ПредставлениеПоИмени = (ОсновноеПредставление = "По имени");
	Элементы.ДеревоИмя.Видимость      = ПредставлениеПоИмени;
	Элементы.ДеревоСиноним.Видимость  = Не ПредставлениеПоИмени;
	Элементы.НайденоИмя.Видимость     = ПредставлениеПоИмени;
	Элементы.НайденоСиноним.Видимость = Не ПредставлениеПоИмени;
	
	Элементы.Найдено.Видимость = Ложь;
	
	Если Параметры.Свойство("ИсключаемыеТипы") Тогда
		ИсключаемыеТипы = Параметры.ИсключаемыеТипы;
	Иначе
		ИсключаемыеТипы = Новый Массив;
	КонецЕсли;
	
	ЗаполнитьДерево(ИсключаемыеТипы);
	
	УстановитьПереданныйТип();

	
	
	
	СписокВыбораСтрокаТип = Элементы.СтрокаТип.СписокВыбора;
	СписокВыбораСтрокаТип.Добавить(ДопустимаяДлина.Переменная, МультиСтрока("Переменная", "Variable"));
	СписокВыбораСтрокаТип.Добавить(ДопустимаяДлина.Фиксированная, МультиСтрока("Фиксированная", "Fixed"));
	СтрокаТип = СписокВыбораСтрокаТип[0].Значение;
	
	СписокВыбораДатаСостав = Элементы.ДатаСостав.СписокВыбора;
	СписокВыбораДатаСостав.Добавить(ЧастиДаты.ДатаВремя, МультиСтрока("Дата время", "Date time"));
	СписокВыбораДатаСостав.Добавить(ЧастиДаты.Дата, МультиСтрока("Дата", "Date"));
	СписокВыбораДатаСостав.Добавить(ЧастиДаты.Время, МультиСтрока("Время", "Time"));
	ДатаСостав = СписокВыбораДатаСостав[0].Значение;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ИнициализироватьСоотвМетаданных();

	Если Дерево.ПолучитьЭлементы().Количество() = 1 Тогда
		Элементы.Дерево.Развернуть(0);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПолучитьПараметры() 
	
	Если Параметры.Свойство("ОсновноеПредставление") Тогда
		ОсновноеПредставление = Параметры.ОсновноеПредставление;
		Если ОсновноеПредставление = "По синониму" Тогда
			Элементы.ОсновноеПредставление.Заголовок = "Представление по имени";
			ПредставлениеПоИмени = Ложь;
		Иначе
			ОсновноеПредставление = "По имени";
			Элементы.ОсновноеПредставление.Заголовок = "Представление по синониму";
			ПредставлениеПоИмени = Истина;
		КонецЕсли;
	Иначе
		ОсновноеПредставление = "По имени";
		Элементы.ОсновноеПредставление.Заголовок = "Представление по синониму";
		ПредставлениеПоИмени = Истина;
	КонецЕсли;
	
	Если Параметры.Свойство("Составной") Тогда
		Составной = Параметры.Составной;
	Иначе
		Составной = Ложь;
	КонецЕсли;
	
	Элементы.Деревопометка.Видимость = Составной;

КонецПроцедуры

&НаСервере
Процедура УстановитьПереданныйТип()
	
	Если Параметры.Свойство("ТипОбъекта") И Параметры.ТипОбъекта <> Неопределено Тогда
		ТипОбъекта = Параметры.ТипОбъекта;
		
		Если ТипОбъекта = "ЛюбаяСсылка"Тогда
			НайденнаяСтрока = НайтиЗначениеВКоллекции(Дерево.ПолучитьЭлементы(), "Имя", ТипОбъекта);
			Если НайденнаяСтрока = Неопределено Тогда
				Возврат;
			КонецЕсли;
			
			НайденнаяСтрока.Пометка = Истина;
			Элементы.Дерево.ТекущаяСтрока = НайденнаяСтрока.ПолучитьИдентификатор();
			Возврат;
		ИначеЕсли СтрНачинаетсяС(ТипОбъекта, "ОпределяемыйТип") Или СтрНачинаетсяС(ТипОбъекта, "Регистр") Тогда
			ЧастиИмени = СтрРазделить(ТипОбъекта, ".");
			НайденнаяСтрока = НайтиЗначениеВКоллекции(Дерево.ПолучитьЭлементы(), "Имя", ЧастиИмени[1], ЧастиИмени[0]);
			Если НайденнаяСтрока = Неопределено Тогда
				Возврат;
			КонецЕсли;
			Элементы.Дерево.ТекущаяСтрока = НайденнаяСтрока.ПолучитьИдентификатор();
			Возврат;
		КонецЕсли;
		
		Если ТипЗнч(ТипОбъекта) = Тип("Строка") Тогда
			ТипОбъекта = ТипПоСтроковомуОписанию(ТипОбъекта);
		КонецЕсли;
		
		Если ТипЗнч(ТипОбъекта) = Тип("Тип") Тогда
			Массив = Новый Массив;
			Массив.Добавить(ТипОбъекта);
			ТипОбъекта = Новый ОписаниеТипов(Массив); 
		КонецЕсли;
		
		Составной = (ТипОбъекта.Типы().Количество() > 1);
		
		ДатаСостав = ТипОбъекта.КвалификаторыДаты.ЧастиДаты;
		
		СтрокаТип = ТипОбъекта.КвалификаторыСтроки.ДопустимаяДлина;
		СтрокаДлина = ТипОбъекта.КвалификаторыСтроки.Длина;
		СтрокаНеограниченная = (СтрокаДлина = 0);
		
		ЧислоДлина = ТипОбъекта.КвалификаторыЧисла.Разрядность;
		ЧислоТочность = ТипОбъекта.КвалификаторыЧисла.РазрядностьДробнойЧасти;
		ЧислоНеотрицательное = (ТипОбъекта.КвалификаторыЧисла.ДопустимыйЗнак = ДопустимыйЗнак.Неотрицательный);
		
		Для Каждого выбТип Из ТипОбъекта.Типы() Цикл
			СтруктураТипа = СтруктураПредставленияТипа(выбТип);
			НайденнаяСтрока = НайтиЗначениеВКоллекции(Дерево.ПолучитьЭлементы(), "Имя", СтруктураТипа.Имя, СтруктураТипа.Родитель);
			Если НайденнаяСтрока = Неопределено Тогда
				Продолжить;
			КонецЕсли;
			
			НайденнаяСтрока.Пометка = Истина;
			Элементы.Дерево.ТекущаяСтрока = НайденнаяСтрока.ПолучитьИдентификатор();
			
		КонецЦикла;
		
	КонецЕсли;

КонецПроцедуры

Функция СтроковоеПредставлениеТипа(ТипИлиОписаниеТипа) 
	
	Если ТипЗнч(ТипИлиОписаниеТипа) = Тип("Тип") Тогда
		МассивТипов = Новый Массив;
		МассивТипов.Добавить(ТипИлиОписаниеТипа);
	ИначеЕсли ТипЗнч(ТипИлиОписаниеТипа) = Тип("Строка") Тогда
		Возврат ТипИлиОписаниеТипа;
	Иначе
		МассивТипов = ТипИлиОписаниеТипа.Типы();
	КонецЕсли;
	
	МассивТиповСтроками = Новый Массив;
	
	Для Каждого выбТип Из МассивТипов Цикл
		
		ОбъектМетаданных = Метаданные.НайтиПоТипу(выбТип);
		Если ОбъектМетаданных = Неопределено Тогда
			ТипСтрокой = Строка(выбТип);
		Иначе
			ТипСтрокой = ОбъектМетаданных.ПолноеИмя();
		КонецЕсли;
		
		МассивТиповСтроками.Добавить(ТипСтрокой);
		
	КонецЦикла;
	
	Значение = СтрСоединить(МассивТиповСтроками, ";");
	
	Возврат Значение;
	
КонецФункции

&НаСервере
Функция ТипПоСтроковомуОписанию(ТипСтрокой) Экспорт 
	
	ЧастиИмени = СтрРазделить(ТипСтрокой, ".", Ложь);
	
	ВидОбъекта = ЧастиИмени[0];
	ИмяОбъекта = ЧастиИмени[1];
	
	
	Соотв = Новый Соответствие;
	Соотв.Вставить("Справочник",                  "СправочникСсылка");
	Соотв.Вставить("Документ",                    "ДокументСсылка");
	Соотв.Вставить("ПланВидовХарактеристик",      "ПланВидовХарактеристикСсылка");
	Соотв.Вставить("ПланСчетов",                  "ПланСчетовСсылка");
	Соотв.Вставить("ПланВидовРасчета",            "ПланВидовРасчетаСсылка");
	Соотв.Вставить("БизнесПроцесс",               "БизнесПроцессСсылка");
	Соотв.Вставить("ТочкаМаршрутаБизнесПроцесса", "ТочкаМаршрутаБизнесПроцессаСсылка");
	Соотв.Вставить("Задача",                      "ЗадачаСсылка");
	Соотв.Вставить("ПланОбмена",                  "ПланОбменаСсылка");
	
	ИмяТипа = Соотв[ВидОбъекта] + "." + ИмяОбъекта;
	
	Возврат Тип(ИмяТипа);
	
КонецФункции

&НаСервере
Функция СтруктураПредставленияТипа(Тип) 
	
	Результат = Новый Структура("Родитель, Имя", "", "");
	
	ПростыеТипы = Новый Соответствие;
	ПростыеТипы.Вставить(Тип("Null"), "Null");
	ПростыеТипы.Вставить(Тип("Неопределено"), "Неопределено");
	ПростыеТипы.Вставить(Тип("Число"), "Число");
	ПростыеТипы.Вставить(Тип("Строка"), "Строка");
	ПростыеТипы.Вставить(Тип("Булево"), "Булево");
	ПростыеТипы.Вставить(Тип("Дата"), "Дата");
	ПростыеТипы.Вставить(Тип("УникальныйИдентификатор"), "УникальныйИдентификатор");
	ПростыеТипы.Вставить(Тип("ХранилищеЗначения"), "ХранилищеЗначения");
	ПростыеТипы.Вставить(Тип("МоментВремени"), "МоментВремени");
	ПростыеТипы.Вставить(Тип("Граница"), "Граница");
	ПростыеТипы.Вставить(Тип("СтандартныйПериод"), "СтандартныйПериод");
	
	ИмяПростогоТипа = ПростыеТипы[Тип];
	Если ИмяПростогоТипа <> Неопределено Тогда
		Результат.Имя = ИмяПростогоТипа;
		Возврат Результат;
	КонецЕсли;
	
	ОбъектМета = Метаданные.НайтиПоТипу(Тип);
	
	Если ОбъектМета = Неопределено Тогда
		Возврат Результат;
	КонецЕсли;
	
	ИмяОбъекта = ОбъектМета.ПолноеИмя();
	
	ЧастиИмени = СтрРазделить(ИмяОбъекта, ".", Ложь);
	
	Результат.Родитель = ЧастиИмени[0];
	Результат.Имя = ЧастиИмени[1];
	
	Возврат Результат;
	
КонецФункции

&НаСервере
Функция НайтиЗначениеВКоллекции(КоллекцияСтрок, ИмяСвойства, Значение, Родитель = Неопределено) 
	
	Если Родитель <> Неопределено Тогда
		Для каждого Строка Из КоллекцияСтрок Цикл
			Если Строка.Имя = Родитель Тогда
				Возврат НайтиЗначениеВКоллекции(Строка.ПолучитьЭлементы(), ИмяСвойства, Значение); 
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
	Для каждого Строка Из КоллекцияСтрок Цикл
		Если Строка[ИмяСвойства] = Значение Тогда
			Возврат Строка;
		КонецЕсли;
		Строки = Строка.ПолучитьЭлементы();
		Если Строки.Количество() > 0 Тогда
			Результат = НайтиЗначениеВКоллекции(Строки, ИмяСвойства, Значение);
			Если Результат <> Неопределено Тогда
				Возврат Результат;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
	Возврат Неопределено;
	
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция МультиСтрока(СтрокаРус, СтрокаАнгл) 
	
	Возврат НСтр("ru = '" + СтрокаРус + "';en = '" + СтрокаАнгл + "'");
	
КонецФункции

&НаСервере
Процедура ЗаполнитьДерево(ИсключаемыеТипы) 
	
	ИсключаемыеТипыОсн = СтрРазделить("Строка,Число,Булево,Дата,МоментВремени,Граница,ХранилищеЗначения,УникальныйИдентификатор,Перечисления", ",", Ложь);
	Для каждого Эл Из ИсключаемыеТипыОсн Цикл
		ИсключаемыеТипы.Добавить(Эл);
	КонецЦикла;
	
	
	ОбработкаОбъект = РеквизитФормыВЗначение("Объект");
	ТабДок = ОбработкаОбъект.ПолучитьМакет("Макет");
	
	Если Ложь Тогда ТабДок = Новый ТабличныйДокумент КонецЕсли;
	
	Соотв = Новый Соответствие;
	Для Сч = 1 По ТабДок.ВысотаТаблицы Цикл
		Значение = ТабДок.Область(Сч, 2, Сч, 2).Текст;
		Соотв.Вставить(Значение, Сч);
	КонецЦикла;
	
	Строки = Дерево.ПолучитьЭлементы();
	Строки.Очистить();
	
	ЭлементыПервогоУровня = ПолучитьЭлементыПервогоУровня(ИсключаемыеТипы);

	
	Для каждого выбЭлемент Из ЭлементыПервогоУровня Цикл
		Строка = Строки.Добавить();
		Строка.ЭтоГруппа = Истина;
		Строка.Имя = выбЭлемент;
		Строка.Синоним = выбЭлемент;
		
		НомСтроки = Соотв[выбЭлемент];
		выбКартинка = ТабДок.Рисунки[НомСтроки - 1].Картинка;	
		
		ДвоичныеДанные = выбКартинка.ПолучитьДвоичныеДанные();
		НовКартинка = Новый Картинка(ДвоичныеДанные, Истина);
		
		Строка.Картинка = НовКартинка;
		
		Если ЭтоПримитивныйТип(выбЭлемент)
			Или выбЭлемент = "ЛюбаяСсылка" Тогда
			
			Строка.ЭтоГруппа = Ложь;
		Иначе
			ЗаполнитьЭлементами(Строка.ПолучитьЭлементы(), выбЭлемент, НовКартинка);	
		КонецЕсли;
	
		
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Функция ПолучитьЭлементыПервогоУровня(ИсключаемыеТипы)
	
	Массив = Новый Массив;
	Массив.Добавить("ЛюбаяСсылка");
	
	Массив.Добавить("Число");
	Массив.Добавить("Строка");
	Массив.Добавить("Булево");
	Массив.Добавить("Дата");
	Массив.Добавить("МоментВремени");
	Массив.Добавить("Граница");
	Массив.Добавить("ХранилищеЗначения");
	Массив.Добавить("УникальныйИдентификатор");
	Массив.Добавить("ОпределяемыеТипы");
	Массив.Добавить("Справочники");
	Массив.Добавить("Документы");
	Массив.Добавить("Перечисления");
	Массив.Добавить("ПланыВидовХарактеристик");
	Массив.Добавить("ПланыСчетов");
	Массив.Добавить("ПланыВидовРасчета");
	Массив.Добавить("БизнесПроцессы");
	Массив.Добавить("ТочкиМаршрутаБизнесПроцесса");
	Массив.Добавить("Задачи");
	Массив.Добавить("ПланыОбмена");
	
	Массив.Добавить("РегистрыСведений");
	Массив.Добавить("РегистрыНакопления");
	Массив.Добавить("РегистрыБухгалтерии");
	Массив.Добавить("РегистрыРасчета");
	
	Для каждого Эл Из ИсключаемыеТипы Цикл
		Инд = Массив.Найти(СокрЛП(Эл));
		Если Инд <> Неопределено Тогда
			Массив.Удалить(Инд);
		КонецЕсли;		
	КонецЦикла;
	
	
	Возврат Массив;

КонецФункции

&НаСервере
Функция СписокЗначенияВМассив(Список) 

	Массив = Новый Массив;
	Для каждого выбЭл Из Список Цикл
		Массив.Добавить(выбЭл.Значение);
	КонецЦикла;
	
	Возврат Массив;
	
КонецФункции


&НаСервере
Процедура ЗаполнитьЭлементами(КоллекцияСтрок, ТипОбъекта, Картинка) 
	
	Если ТипОбъекта = "ТочкиМаршрутаБизнесПроцесса" Тогда
		Мета = Метаданные["БизнесПроцессы"];
	ИначеЕсли ТипОбъекта = "ЛюбаяСсылка" Тогда
		Возврат;
	Иначе
		Мета = Метаданные[ТипОбъекта];
	КонецЕсли;
	
	Для каждого Эл Из Мета Цикл
		
		Строка = КоллекцияСтрок.Добавить();
		Строка.ЭтоГруппа = Ложь;
		Строка.Имя = Эл.Имя;
		
		Если ЗначениеЗаполнено(Эл.Синоним) Тогда
			Строка.Синоним = Эл.Синоним;
		Иначе
			Строка.Синоним = Эл.Имя;
		КонецЕсли;
		Строка.Картинка = Картинка;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Функция ЭтоПримитивныйТип(ПроверяемыйТип)
	
	Если ПроверяемыйТип = "Неопределено"
		Или ПроверяемыйТип = "Булево"
		Или ПроверяемыйТип = "Строка"
		Или ПроверяемыйТип = "Число"
		Или ПроверяемыйТип = "Дата"
		Или ПроверяемыйТип = "СтандартныйПериод"
		Или ПроверяемыйТип = "МоментВремени"
		Или ПроверяемыйТип = "Граница"
		Или ПроверяемыйТип = "ХранилищеЗначения"
		Или ПроверяемыйТип = "УникальныйИдентификатор" Тогда
		
		Возврат Истина;
		
	Иначе
		
		Возврат Ложь;
		
	КонецЕсли;
	
КонецФункции

&НаКлиенте
Процедура СнятьВсеПометки(КоллекцияСтрок) 
	
	Для каждого Строка Из КоллекцияСтрок Цикл
		Строка.Пометка = Ложь;
		Строки = Строка.ПолучитьЭлементы();
		Если Строки.Количество() > 0 Тогда
			СнятьВсеПометки(Строки);
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ДеревоПометкаПриИзменении(Элемент)
	
	ТекДанные = Элементы.Дерево.ТекущиеДанные;
	Пометка = ТекДанные.Пометка;
	
	Если Составной = Ложь Тогда
		//СнятьВсеПометки(Дерево.ПолучитьЭлементы());
		ТекДанные.Пометка = Пометка;
	КонецЕсли;
	
	Элементы.ГруппаСтрока.Доступность = ТекДанные.Пометка;
	Элементы.ГруппаЧисло.Доступность = ТекДанные.Пометка;
	Элементы.ГруппаДата.Доступность = ТекДанные.Пометка;
	
КонецПроцедуры

&НаКлиенте
Процедура СоставнойПриИзменении(Элемент)
	
	ТекДанные = Элементы.Дерево.ТекущиеДанные;
	Если ТекДанные <> Неопределено Тогда
		Пометка = ТекДанные.Пометка;
	КонецЕсли;
	
	Если Составной = Ложь Тогда
		СнятьВсеПометки(Дерево.ПолучитьЭлементы());
	КонецЕсли;
	
	Если ТекДанные <> Неопределено Тогда
		ТекДанные.Пометка = Пометка;
	КонецЕсли;
	
	
КонецПроцедуры

&НаКлиенте
Процедура ДеревоПриАктивизацииСтроки(Элемент)
	
	ТекДанные = Элемент.ТекущиеДанные;
	
	Если ТекДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Элементы.ГруппаСтрока.Видимость = ТекДанные.Имя = "Строка";
	Элементы.ГруппаЧисло.Видимость = ТекДанные.Имя = "Число";
	Элементы.ГруппаДата.Видимость = ТекДанные.Имя = "Дата";
	
	Если Составной Тогда
		Элементы.ГруппаСтрока.Доступность = ТекДанные.Пометка;
		Элементы.ГруппаЧисло.Доступность = ТекДанные.Пометка;
		Элементы.ГруппаДата.Доступность = ТекДанные.Пометка;
	КонецЕсли;
	
	
КонецПроцедуры

&НаКлиенте
Процедура СтрокаНеограниченнаяПриИзменении(Элемент)
	
	Если СтрокаНеограниченная Тогда
		СтрокаТип = Элементы.СтрокаТип[0].Значение;
		СтрокаДлина = 0;
		Элементы.СтрокаТип.Доступность = Ложь;
	Иначе
		Элементы.СтрокаТип.Доступность = Истина;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОсновноеПредставление(Команда)
	
	Если ОсновноеПредставление = "По синониму" Тогда
		ОсновноеПредставление = "По имени";
		Элементы.ОсновноеПредставление.Заголовок = "Представление по синониму";
		Элементы.ДеревоИмя.Видимость = Истина;
		Элементы.ДеревоСиноним.Видимость = Ложь;
		Элементы.НайденоИмя.Видимость = Истина;
		Элементы.НайденоСиноним.Видимость = Ложь;
	Иначе
		ОсновноеПредставление = "По синониму";
		Элементы.ОсновноеПредставление.Заголовок = "Представление по имени";
		Элементы.ДеревоИмя.Видимость = Ложь;
		Элементы.ДеревоСиноним.Видимость = Истина;
		Элементы.НайденоИмя.Видимость = Ложь;
		Элементы.НайденоСиноним.Видимость = Истина;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаОк(Команда)
	
	ВыбратьИЗакрыть();
	
	
КонецПроцедуры

&НаКлиенте
Процедура ВыбратьИЗакрыть() 
	
	Если Элементы.Найдено.Видимость Тогда
		Если Элементы.Найдено.ТекущиеДанные = Неопределено Тогда
			Возврат;
		КонецЕсли;
	
		КлючСвязиДерево = Элементы.Найдено.ТекущиеДанные.КлючСвязиДерево;
		СтрокаДерева = Дерево.НайтиПоИдентификатору(КлючСвязиДерево);
		ТекДанные = СтрокаДерева;
	Иначе
		Если Элементы.Дерево.ТекущиеДанные = Неопределено Тогда
			Возврат;
		КонецЕсли;
		
		ТекДанные = Элементы.Дерево.ТекущиеДанные;
	КонецЕсли;
	
	Если ТекДанные.ЭтоГруппа Тогда
		Возврат;
	КонецЕсли;
	
	Если Составной Тогда
		ТекДанные.Пометка = Истина;
		ВсеВыборы = СобратьРезультат(Дерево.ПолучитьЭлементы());
		ТипыСтрокой = СтрСоединить(ВсеВыборы, ",");
	Иначе
		Родитель = ТекДанные.ПолучитьРодителя();
		Если Родитель <> Неопределено Тогда
			ТипыСтрокой = мСоотвМетаданных[Родитель.Имя] + "." + ТекДанные.Имя;
		Иначе
			ТипыСтрокой = ТекДанные.Имя;
		КонецЕсли;
	КонецЕсли;
	
	КвалификаторСтроки = Новый КвалификаторыСтроки(СтрокаДлина, СтрокаТип);
	КвалификаторДаты = Новый КвалификаторыДаты(ДатаСостав);
	
	ДопЗнак = ?(ЧислоНеотрицательное, ДопустимыйЗнак.Неотрицательный, ДопустимыйЗнак.Любой);
	КвалификаторЧисла = Новый КвалификаторыЧисла(ЧислоДлина, ЧислоТочность, ДопЗнак);
	
	Если СтрНачинаетсяС(ТипыСтрокой, "Регистр")
		Или СтрНайти(ТипыСтрокой, ",Регистр") > 0 Тогда 
		
		ОписаниеТипов = Неопределено;	//для регистров нет описания типов
		Представление = ТипыСтрокой;
		
	ИначеЕсли ТипыСтрокой = "ЛюбаяСсылка" Тогда
		ОписаниеТипов = ОписаниеТипаВсеСсылки();
		Представление = "ЛюбаяСсылка";
	ИначеЕсли Родитель.Имя = "ОпределяемыеТипы" Тогда
		ОписаниеТипов = ОписаниеОпределяемогоТипа(ТекДанные.Имя);
		Представление = "ОпределяемыйТип." + ТекДанные.Имя;
	Иначе
		ОписаниеТипов = Новый ОписаниеТипов(ТипыСтрокой, КвалификаторЧисла, КвалификаторСтроки, КвалификаторДаты);
		Представление = СтроковоеПредставлениеТипа(ОписаниеТипов);	
	КонецЕсли;
	
	Результат = Новый Структура("ОписаниеТипов, Представление", ОписаниеТипов, Представление);
	Закрыть(Результат);
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ОписаниеОпределяемогоТипа(ИмяТипа) 
	
	Возврат Метаданные.ОпределяемыеТипы[ИмяТипа].Тип;
	
КонецФункции

&НаСервереБезКонтекста
Функция ОписаниеТипаВсеСсылки() 
	
	Возврат Новый ОписаниеТипов(Новый ОписаниеТипов(Новый ОписаниеТипов(Новый ОписаниеТипов(Новый ОписаниеТипов(
		Новый ОписаниеТипов(Новый ОписаниеТипов(Новый ОписаниеТипов(Новый ОписаниеТипов(
			Справочники.ТипВсеСсылки(),
			Документы.ТипВсеСсылки().Типы()),
			ПланыОбмена.ТипВсеСсылки().Типы()),
			Перечисления.ТипВсеСсылки().Типы()),
			ПланыВидовХарактеристик.ТипВсеСсылки().Типы()),
			ПланыСчетов.ТипВсеСсылки().Типы()),
			ПланыВидовРасчета.ТипВсеСсылки().Типы()),
			БизнесПроцессы.ТипВсеСсылки().Типы()),
			БизнесПроцессы.ТипВсеСсылкиТочекМаршрутаБизнесПроцессов().Типы()),
			Задачи.ТипВсеСсылки().Типы());
	
КонецФункции
	
&НаКлиенте
Функция СобратьРезультат(КоллекцияЭлементов, МассивТипов = Неопределено) 
	
	Если МассивТипов = Неопределено Тогда
		МассивТипов = Новый Массив;
	КонецЕсли;
	
	Для каждого Строка Из КоллекцияЭлементов Цикл
		
		Если Строка.Пометка Тогда
			Родитель = Строка.ПолучитьРодителя();
			Если Родитель <> Неопределено Тогда
				Тип = мСоотвМетаданных[Родитель.Имя] + "." + Строка.Имя;
				МассивТипов.Добавить(Тип);
			Иначе
				МассивТипов.Добавить(Строка.Имя);
			КонецЕсли;
		КонецЕсли;
		
		Строки = Строка.ПолучитьЭлементы();
		Если Строки.Количество() > 0 Тогда
			СобратьРезультат(Строки, МассивТипов);
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат МассивТипов;
	
КонецФункции

&НаКлиенте
Процедура ИнициализироватьСоотвМетаданных()
	
	мСоотвМетаданных = Новый Соответствие;
	мСоотвМетаданных.Вставить("Число",                       "Число");
	мСоотвМетаданных.Вставить("Строка",                      "Строка");
	мСоотвМетаданных.Вставить("Булево",                      "Булево");
	мСоотвМетаданных.Вставить("Дата",                        "Дата");
	мСоотвМетаданных.Вставить("УникальныйИдентификатор",     "УникальныйИдентификатор");
	мСоотвМетаданных.Вставить("ОпределяемыеТипы",            "ОпределяемыйТип");
	мСоотвМетаданных.Вставить("Справочники",                 "СправочникСсылка");
	мСоотвМетаданных.Вставить("Документы",                   "ДокументСсылка");
	мСоотвМетаданных.Вставить("Перечисления",                "ПеречислениеСсылка");
	мСоотвМетаданных.Вставить("ПланыВидовХарактеристик",     "ПланВидовХарактеристикСсылка");
	мСоотвМетаданных.Вставить("ПланыСчетов",                 "ПланСчетовСсылка");
	мСоотвМетаданных.Вставить("ПланыВидовРасчета",           "ПланВидовРасчетаСсылка");
	мСоотвМетаданных.Вставить("БизнесПроцессы",              "БизнесПроцессСсылка");
	мСоотвМетаданных.Вставить("Задачи",                      "ЗадачаСсылка");
	мСоотвМетаданных.Вставить("ПланыОбмена",                 "ПланОбменаСсылка");
	мСоотвМетаданных.Вставить("ТочкиМаршрутаБизнесПроцесса", "ТочкаМаршрутаБизнесПроцессаСсылка");
	
	мСоотвМетаданных.Вставить("РегистрыСведений",            "РегистрСведений");
	мСоотвМетаданных.Вставить("РегистрыНакопления",          "РегистрНакопления");
	мСоотвМетаданных.Вставить("РегистрыБухгалтерии",         "РегистрБухгалтерии");
	мСоотвМетаданных.Вставить("РегистрыРасчета",             "РегистрРасчета");

КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьПоиск(ЗначениеПоиска) Экспорт 
	
	Если ЗначениеЗаполнено(ЗначениеПоиска) Тогда
			ПоказатьРезультатыПоиска();
	Иначе
		Элементы.Дерево.Видимость = Истина;
		Элементы.Найдено.Видимость = Ложь;
	КонецЕсли;
	
	Если ТекущийЭлемент = Элементы.Поиск Тогда
		Элементы.Поиск.СочетаниеКлавиш = Новый СочетаниеКлавиш(Клавиша.Нет);
	Иначе
		Элементы.Поиск.СочетаниеКлавиш = Новый СочетаниеКлавиш(Клавиша.Space);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПоказатьРезультатыПоиска() 
	
	Элементы.Дерево.Видимость = Ложь;
	Элементы.ГруппаКвалификаторы.Видимость = Ложь;
	Элементы.Найдено.Видимость = Истина;
	Найдено.ПолучитьЭлементы().Очистить();
	
	МассивСлов = СтрРазделить(Элементы.Поиск.ТекстРедактирования, " ", Ложь);
	Если МассивСлов.Количество() = 0 Тогда
		Возврат;	
	КонецЕсли;
	
	Если ОсновноеПредставление = "По имени" Тогда
		ЗаполнитьНайдено(Дерево.ПолучитьЭлементы(), "Имя", МассивСлов);
	Иначе
		ЗаполнитьНайдено(Дерево.ПолучитьЭлементы(), "Синоним", МассивСлов);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьНайдено(КоллекцияСтрок, ИмяСвойства, МассивСлов) 
	
	Перем СтрокиНайдено;
	
	Для каждого Строка Из КоллекцияСтрок Цикл
		
		Если Строка.ЭтоГруппа Тогда
			ЗаполнитьНайдено(Строка.ПолучитьЭлементы(), ИмяСвойства, МассивСлов);
			Продолжить;
		КонецЕсли;
		
		ИсходнаяСтрока = НРег(Строка[ИмяСвойства]);
		
		НайденоВСтроке = Истина;
		Для Сч = 0 По МассивСлов.ВГраница() Цикл
			Если СтрНайти(ИсходнаяСтрока, МассивСлов[Сч]) = 0 Тогда
				НайденоВСтроке = Ложь;
				Прервать;
			КонецЕсли;
		КонецЦикла;
		Если НайденоВСтроке = Истина Тогда
			Если СтрокиНайдено = Неопределено Тогда
				СтрокиНайдено = Найдено.ПолучитьЭлементы();
			КонецЕсли;
			НовСтрока = СтрокиНайдено.Добавить();
			ЗаполнитьЗначенияСвойств(НовСтрока, Строка);
			НовСтрока.КлючСвязиДерево = Строка.ПолучитьИдентификатор();
			НовСтрока.Имя = Новый ФорматированнаяСтрока(НовСтрока.Имя, , WebЦвета.ЗеленаяЛужайка);
		КонецЕсли;
		
		Строки = Строка.ПолучитьЭлементы();
		Если Строки.Количество() > 0 Тогда
			ЗаполнитьНайдено(Строки, ИмяСвойства, МассивСлов);
		КонецЕсли;
		
	КонецЦикла;
	
	
КонецПроцедуры

&НаКлиенте
Процедура ДеревоВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	ТекДанные = Элемент.ТекущиеДанные;
	
	Если ТекДанные.ЭтоГруппа = Ложь И (
		Элемент.ТекущийЭлемент = Элементы.ДеревоИмя Или 
		Элемент.ТекущийЭлемент = Элементы.ДеревоСиноним) Тогда
		
		Если Составной Тогда
			Пометка = ТекДанные.Пометка;
			
			Если ТекДанные.ЭтоГруппа = Ложь И Составной = Ложь Тогда
				СнятьВсеПометки(Дерево.ПолучитьЭлементы());
			КонецЕсли;
			
			ТекДанные.Пометка = Не Пометка;
			
		Иначе
			СнятьВсеПометки(Дерево.ПолучитьЭлементы());
			ВыбратьИЗакрыть();
		КонецЕсли;

	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура АктивизироватьПолеПоиска(Команда)
	
	Если ТекущийЭлемент = Элементы.Поиск Тогда
		Возврат;	
	КонецЕсли;
	
	ТекущийЭлемент = Элементы.Поиск;
	
КонецПроцедуры

&НаКлиенте
Процедура ПоискАвтоПодбор(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, Ожидание, СтандартнаяОбработка)
	
	ВыполнитьПоиск(Текст);
	Если Не ЗначениеЗаполнено(Текст) Тогда
		ОбновитьЭлементыПослеЗавершенияПоиска();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура НайденоВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	Если Составной Тогда
		Элементы.Дерево.ТекущаяСтрока = Элементы.Найдено.ТекущиеДанные.КлючСвязиДерево;
	
		ОбновитьЭлементыПослеЗавершенияПоиска();
	Иначе
		Ид = Элементы.Найдено.ТекущиеДанные.КлючСвязиДерево;
		Элементы.Дерево.ТекущаяСтрока = Ид;
		Дерево.НайтиПоИдентификатору(Ид).Пометка = Истина;
		ВыбратьИЗакрыть();
	КонецЕсли;
	
	
КонецПроцедуры

&НаКлиенте
Процедура ПоискОчистка(Элемент, СтандартнаяОбработка)
	
	ОбновитьЭлементыПослеЗавершенияПоиска();
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьЭлементыПослеЗавершенияПоиска() 
	
	Элементы.Поиск.СочетаниеКлавиш = Новый СочетаниеКлавиш(Клавиша.Space);
	Элементы.Дерево.Видимость = Истина;
	Элементы.Найдено.Видимость = Ложь;
	Элементы.ГруппаКвалификаторы.Видимость = Истина;
	
	Поиск = "";
	
КонецПроцедуры
